Информационная_база/Documents/ТестБинарноеДерево.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТестБинарноеДерево</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Опрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаТеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируемыйРаздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Разделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСдачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийУзелДерева</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаДерева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднееВремяОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееВремяПрохождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПравильныхОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеправильныхОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяГлубинаДерева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьПодсказки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныБинарныхДеревьев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветыБинарногоДерева</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляТестирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрытыйОтвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УзелДерева</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляТестирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОтветаБинарный</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОтветовБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОтвета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНаОтвет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыБинарногоДерева</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Разделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляТестирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветПолучен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правильность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УзелДерева</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньДерева</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПерехода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПереходовБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокПрохождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВопроса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУзла</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУзловБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураДереваТеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелДерева</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительскийУзел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСвязи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОтветовБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляТестирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвляетсяЛистом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Информационная_база/InformationRegisters/СтруктураБинарногоДерева.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтруктураБинарногоДерева</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СледующийУзелДерева</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СостояниеСвязи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСвязиБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШаблонТеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныБинарныхДеревьев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РодительскийУзел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтветовБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Информационная_база/Enums/ТипыОтветовБинарногоДерева.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОтветовБинарногоДерева</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Информационная_база/Catalogs/УзлыБинарногоДерева.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УзлыБинарногоДерева</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяЛистом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Информационная_база/Documents/ТестБинарноеДерево/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если документ новый и респондент не заполнен, подставляем текущего пользователя
	Если Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Объект.Респондент) Тогда
		Объект.Респондент = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// Создаем реквизиты и сам интерфейс один раз при создании формы
	СоздатьРеквизитыФормыНаСервере();
	СоздатьИнтерфейсТестирования();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// *** КЛЮЧЕВОЕ ИСПРАВЛЕНИЕ ***
	// После того как сервер отработал, на клиенте мы просто
	// просим форму полностью обновить свое представление на основе данных объекта.
	// Это заставит ее "увидеть" значение в Объект.Опрос и отобразить его.
	ОбновитьИнтерфейс();
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Принудительно обновляем интерфейс после записи,
	// так как могли измениться ключевые поля (например, ШаблонТеста)
	ОбновитьСостояниеИнтерфейсаНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Обновляем состояние на клиенте, чтобы изменения были видны сразу
	ОбновитьСостояниеИнтерфейсаНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область ДинамическоеСозданиеИнтерфейса

&НаСервере
Процедура СоздатьРеквизитыФормыНаСервере()
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ТекстТекущегоВопроса", Новый ОписаниеТипов("ФорматированныйДокумент"));
	СтруктураРеквизитов.Вставить("ИсторияОтветов", Новый ОписаниеТипов("ФорматированныйДокумент"));
	ДФИ.СоздатьРеквизиты(ЭтотОбъект, СтруктураРеквизитов);
КонецПроцедуры

&НаСервере
Процедура СоздатьИнтерфейсТестирования()
	
	// --- Группа 1: Основная информация (статичная) ---
	ГруппаОсновная = ДФИ.СздГруппаОбычная(ЭтотОбъект, "ГруппаОсновная", ЭтотОбъект, "Основные данные");
	ГруппаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	ДФИ.СздПоле(ЭтотОбъект, "Номер", ГруппаОсновная, "Номер:", 1, "Объект.Номер");
	ДФИ.СздПоле(ЭтотОбъект, "Дата", ГруппаОсновная, "Дата:", 1, "Объект.Дата");
	
	// *** КЛЮЧЕВОЕ ИСПРАВЛЕНИЕ ***
	// Создаем поле и СРАЗУ делаем его недоступным. Не нужно никаких сложных схем.
	//ПолеОпрос = ДФИ.СздПоле(ЭтотОбъект, "Опрос", ГруппаОсновная, "Назначение:", 1, "Объект.Опрос");
	//ПолеОпрос.ТолькоПросмотр = Истина;
	//
	//ДФИ.СздПоле(ЭтотОбъект, "ШаблонТеста", ГруппаОсновная, "Шаблон:", 1, "Объект.ШаблонТеста");
	ДФИ.СздПоле(ЭтотОбъект, "Респондент", ГруппаОсновная, "Респондент:", 1, "Объект.Респондент");

	// --- Группа 2: Начало теста (одна кнопка) ---
	ГруппаНачало = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаНачалоТеста", ЭтотОбъект);
	ДФИ.СоздатьКоманду(ЭтотОбъект, "НачатьТестирование", "Начать тестирование", "НачатьТестирование");
	ДФИ.СздКнопка(ЭтотОбъект, "КнопкаНачать", ГруппаНачало, "Начать тестирование", "НачатьТестирование");

	// --- Группа 3: Прохождение теста (вопрос и кнопки Да/Нет) ---
	ГруппаПрохождение = ДФИ.СздГруппаОбычная(ЭтотОбъект, "ГруппаПрохождениеТеста", ЭтотОбъект, "Вопрос:");
	
	ПолеВопроса = ДФИ.СздПоле(ЭтотОбъект, "ПолеТекущегоВопроса", ГруппаПрохождение, "", 1, "ТекстТекущегоВопроса");
	ПолеВопроса.Вид = ВидПоляФормы.ПолеФорматированногоДокумента;
	ПолеВопроса.РастягиватьПоВертикали = Истина;
	ПолеВопроса.Высота = 5;
	ПолеВопроса.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	ГруппаКнопок = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаКнопокОтвета", ГруппаПрохождение);
	ГруппаКнопок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	ДФИ.СоздатьКоманду(ЭтотОбъект, "ОтветитьДа", "    Да    ", "ОтветитьДа");
	ДФИ.СоздатьКоманду(ЭтотОбъект, "ОтветитьНет", "    Нет    ", "ОтветитьНет");
	ДФИ.СздКнопка(ЭтотОбъект, "КнопкаДа", ГруппаКнопок, "    Да    ", "ОтветитьДа");
	ДФИ.СздКнопка(ЭтотОбъект, "КнопкаНет", ГруппаКнопок, "    Нет    ", "ОтветитьНет");

	// --- Группа 4: История ответов ---
	ГруппаИстория = ДФИ.СздГруппаОбычная(ЭтотОбъект, "ГруппаИстория", ЭтотОбъект, "История ответов");
	ПолеИстория = ДФИ.СздПоле(ЭтотОбъект, "ПолеИсторияОтветов", ГруппаИстория, "", 1, "ИсторияОтветов");
	ПолеИстория.Вид = ВидПоляФормы.ПолеФорматированногоДокумента;
	ПолеИстория.РастягиватьПоВертикали = Истина;
	ПолеИстория.Высота = 10;
	ПолеИстория.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	// --- Группа 5: Результаты теста ---
	ГруппаРезультаты = ДФИ.СздГруппаОбычная(ЭтотОбъект, "ГруппаРезультатыТеста", ЭтотОбъект, "Результаты тестирования");
	ДФИ.СздПоле(ЭтотОбъект, "РезультатСдачи", ГруппаРезультаты, "Результат:", 1, "Объект.РезультатСдачи").ТолькоПросмотр = Истина;
	ДФИ.СздПоле(ЭтотОбъект, "ОбщееВремя", ГруппаРезультаты, "Затрачено времени (сек):", 1, "Объект.ОбщееВремяПрохождения").ТолькоПросмотр = Истина;

	// Обновляем видимость созданных элементов
	ОбновитьСостояниеИнтерфейсаНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область КомандыФормы

&НаКлиенте
Процедура НачатьТестирование(Команда)
	НачатьТестированиеНаСервере();
	ОбновитьСостояниеИнтерфейсаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьДа(Команда)
	ОбработатьОтветНаСервере("Да");
	ОбновитьСостояниеИнтерфейсаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьНет(Команда)
	ОбработатьОтветНаСервере("Нет");
	ОбновитьСостояниеИнтерфейсаНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеИнтерфейсаНаКлиенте()
	// Просим сервер обновить состояние
	ОбновитьСостояниеИнтерфейсаНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбновитьСостояниеИнтерфейсаНаСервере()
	
	ТестУжеЗавершен = Объект.Завершен;
	ТестНачат = ЗначениеЗаполнено(Объект.ВремяНачалаТеста);
	
	Элементы.ГруппаПрохождениеТеста.Видимость = ТестНачат И НЕ ТестУжеЗавершен;
	Элементы.ГруппаРезультатыТеста.Видимость = ТестУжеЗавершен;
	Элементы.ГруппаНачалоТеста.Видимость = НЕ ТестНачат И НЕ ТестУжеЗавершен;
	Элементы.ГруппаИстория.Видимость = ТестНачат;
	
	//Элементы.ШаблонТеста.ТолькоПросмотр = ТестНачат;
	Элементы.Респондент.ТолькоПросмотр = ТестНачат;
	
	Если ТестНачат Тогда
		Если НЕ ТестУжеЗавершен И ЗначениеЗаполнено(Объект.ТекущийУзелДерева) Тогда
			УзелОбъект = Объект.ТекущийУзелДерева.ПолучитьОбъект();
			Если НЕ УзелОбъект.ЯвляетсяЛистом И ЗначениеЗаполнено(УзелОбъект.Вопрос) Тогда
				ФД_Вопрос = Новый ФорматированныйДокумент;
				ФД_Вопрос.УстановитьHTML(УзелОбъект.Вопрос.ТекстФормулировки, Новый Структура());
				ЭтотОбъект.ТекстТекущегоВопроса = ФД_Вопрос;
			КонецЕсли;
		ИначеЕсли ТестУжеЗавершен И ЗначениеЗаполнено(Объект.ТекущийУзелДерева) Тогда
			ФД_Вопрос = Новый ФорматированныйДокумент;
			ФД_Вопрос.УстановитьHTML("Тест завершен. Итоговый результат: <b>" + Объект.ТекущийУзелДерева.Наименование + "</b>", Новый Структура());
			ЭтотОбъект.ТекстТекущегоВопроса = ФД_Вопрос;
		КонецЕсли;
		
		ОбновитьИсториюОтветовНаСервере();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура НачатьТестированиеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Структура.СледующийУзелДерева
	|ИЗ
	|	РегистрСведений.СтруктураБинарногоДерева КАК Структура
	|ГДЕ
	|	Структура.ШаблонТеста = &Шаблон
	|	И Структура.РодительскийУзел = ЗНАЧЕНИЕ(Справочник.УзлыБинарногоДерева.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Шаблон", Объект.ШаблонТеста);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Сообщить("Для данного шаблона не найдена структура дерева или корневой узел!");
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Объект.ТекущийУзелДерева = Выборка.СледующийУзелДерева;
	Объект.ВремяНачалаТеста = ТекущаяДата();
	Объект.Завершен = Ложь;
	Объект.ОтветыБинарногоДерева.Очистить();
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьОтветНаСервере(ОтветСтрокой)
	
	ТипОтвета = Неопределено;
	Если ОтветСтрокой = "Да" Тогда
		ТипОтвета = Перечисления.ТипыОтветовБинарногоДерева.Да;
	ИначеЕсли ОтветСтрокой = "Нет" Тогда
		ТипОтвета = Перечисления.ТипыОтветовБинарногоДерева.Нет;
	КонецЕсли;
	
	ПредыдущийУзел = Объект.ТекущийУзелДерева;
	НоваяСтрока = Объект.ОтветыБинарногоДерева.Добавить();
	НоваяСтрока.УзелДерева = ПредыдущийУзел;
	НоваяСтрока.Вопрос = ПредыдущийУзел.ПолучитьОбъект().Вопрос;
	НоваяСтрока.ТипОтветаБинарный = ТипОтвета;
	НоваяСтрока.НомерШага = Объект.ОтветыБинарногоДерева.Количество();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Структура.СледующийУзелДерева,
	|	Структура.СледующийУзелДерева.ЯвляетсяЛистом КАК СледующийУзелЭтоЛист
	|ИЗ
	|	РегистрСведений.СтруктураБинарногоДерева КАК Структура
	|ГДЕ
	|	Структура.ШаблонТеста = &Шаблон
	|	И Структура.РодительскийУзел = &ТекущийУзел
	|	И Структура.ТипОтвета = &ТипОтвета";
	
	Запрос.УстановитьПараметр("Шаблон", Объект.ШаблонТеста);
	Запрос.УстановитьПараметр("ТекущийУзел", Объект.ТекущийУзелДерева);
	Запрос.УстановитьПараметр("ТипОтвета", ТипОтвета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.ТекущийУзелДерева = Выборка.СледующийУзелДерева;
		Если Выборка.СледующийУзелЭтоЛист Тогда
			ЗавершитьТестированиеНаСервере();
		КонецЕсли;
	Иначе
		Сообщить("Структура дерева неполная. Тест завершен на текущем узле.");
		ЗавершитьТестированиеНаСервере();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗавершитьТестированиеНаСервере()
	
	Объект.Завершен = Истина;
	Объект.ВремяЗавершения = ТекущаяДата();
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаТеста) Тогда
		Объект.ОбщееВремяПрохождения = (Объект.ВремяЗавершения - Объект.ВремяНачалаТеста);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ОбновитьИсториюОтветовНаСервере()
	
	ТекстHTML = "<div style='font-family: sans-serif; font-size: 14px;'>";
	
	Для Каждого СтрокаОтвета Из Объект.ОтветыБинарногоДерева Цикл
		
		ТекстВопроса = СтрокаОтвета.Вопрос.ТекстФормулировки;
		
		ОтветПользователя = "";
		Если СтрокаОтвета.ТипОтветаБинарный = Перечисления.ТипыОтветовБинарногоДерева.Да Тогда
			ОтветПользователя = "<b style='color:green;'>Да</b>";
		ИначеЕсли СтрокаОтвета.ТипОтветаБинарный = Перечисления.ТипыОтветовБинарногоДерева.Нет Тогда
			ОтветПользователя = "<b style='color:red;'>Нет</b>";
		КонецЕсли;
		
		ТекстHTML = ТекстHTML + "<b>" + Строка(СтрокаОтвета.НомерШага) + ". " + ТекстВопроса + "</b><br>";
		ТекстHTML = ТекстHTML + "<span style='padding-left: 20px;'>Ваш ответ: " + ОтветПользователя + "</span><br><br>";
		
	КонецЦикла;
	
	Если Объект.Завершен И ЗначениеЗаполнено(Объект.ТекущийУзелДерева) Тогда
		ТекстHTML = ТекстHTML + "<hr><b>ИТОГ: " + Объект.ТекущийУзелДерева.Наименование + "</b>";
	КонецЕсли;
	
	ТекстHTML = ТекстHTML + "</div>";
	
	ФД = Новый ФорматированныйДокумент;
	ФД.УстановитьHTML(ТекстHTML, Новый Структура());
	
	ЭтотОбъект.ИсторияОтветов = ФД;
	
КонецПроцедуры

#КонецОбласти
